app/Http/Controllers/app/settings/business/businessController.php

   public function index(){
      $business = business::find(Auth::user()->businessID);
      $logs = activity_log::where('businessID',Auth::user()->businessID)->orderby('id','desc')->get();
      $industry = industry::orderby('id','desc')->pluck('name','id')->prepend('Choose industry','');
      $country = country::orderby('id','desc')->pluck('name','id')->prepend('Choose country','');
      $currency = currency::all();
      $staffs = User::where('businessID', Auth::user()->businessID)
               ->select('*','businessID as business','id as staffID')
               ->orderby('id','desc')
               ->get();
---
select *, `businessID` as `business`, `id` as `staffID` from `users` where `businessID` = 1 order by `id` desc

         $business->logo = $fileName;
      }

      $business->save();
---
update `business` set `logo` = 'WUPjdAOwR.png', `street` = 'University RD', `city` = 'Nairobi', `state_province` = 'Nairobi', `primary_phonenumber` = '+254 0733 191082', `website` = 'www.ascendas.co.ke', `business`.`updated_at` = '2021-06-09 14:18:47' where `id` = 1