app/Http/Controllers/Auth/LoginController.php

   function authenticated(Request $request, $user)
   {
      $user->last_login = Carbon::now();
      $user->last_login_ip = $request->getClientIp();
      $user->save();
---
update `users` set `last_login` = '2021-06-09 14:23:06', `last_login_ip` = '41.212.94.234', `users`.`updated_at` = '2021-06-09 14:23:06' where `id` = 5