app/Http/Controllers/Auth/RegisterController.php

select count(*) as aggregate from `users` where `email` = 'bluetreekenya@gmail.com'
insert into `users` (`name`, `email`, `password`, `remember_token`, `updated_at`, `created_at`) values ('Blue tree agency', 'bluetreekenya@gmail.com', 'y$sdu8jny4KyUJ11FFmTF4puRq71Dk4KOlJhtZHzM9Jvy1N56cHPMmO', 'V0hg5Yk3lZLYP5pWVo', '2021-06-09 12:22:45', '2021-06-09 12:22:45')
---
   public function signup(Request $request){
      $this->validate($request, [
         'full_names' => 'required',
         'email' => 'required', 'string', 'email', 'max:255', 'unique:users',
         'password' => ['required', 'string', 'min:12', 'confirmed'],
      ]);

      //token
      $token = Helper::generateRandomString(18);

      $checkEmail = User::where('email',$request->email)->count();
      if($checkEmail != 0){
         Session::flash('warning','The email your entered is already in use');

         return redirect()->back();
      }

      //add to user table
      $user = new User;
      $user->name = $request->full_names;
      $user->email = $request->email;
      $user->password = Hash::make($request->password);
      $user->remember_token = $token;
      $user->save();

insert into `business` (`name`, `primary_email`, `industry`, `base_currency`, `country`, `company_size`, `businessID`, `userID`, `templateID`, `plan`, `due_date`, `date_joined`, `ip`, `updated_at`, `created_at`) values ('Blue tree agency', 'bluetreekenya@gmail.com', 1, 132, 110, 1, 'yKna5OiRotBNLT2g', 4, 3, 1, '2021-07-09', '2021-06-09 12:22:45', '41.212.94.234', '2021-06-09 12:22:45', '2021-06-09 12:22:45')
---
      $business->due_date = $billingStart;
      $business->date_joined = $dateJoined;
      $business->ip =  request()->ip();
      $business->save();

insert into `role_user` (`role_id`, `user_id`, `user_type`) values (1, 4, 'App\Models\wingu\User')
---
      $role->role_id = 1;
      $role->user_id = $user->id;
      $role->user_type = 'App\Models\wingu\User';
      $role->save();