app/Http/Controllers/app/property/property/unitsController.php

   public function index($id)
   {
      $property = property::where('businessID',Auth::user()->businessID)->where('id',$id)->first();
      $units = property::where('businessID',Auth::user()->businessID)
               ->where('parentID',$id)
               ->orderby('property.id','desc')
               ->select('*', 'property.id as propID')
               ->get();
---
select *, `property`.`id` as `propID` from `property` where `businessID` = 1 and `parentID` = '2' order by `property`.`id` desc

   public function create($id)
   {
      $property = property::where('businessID',Auth::user()->businessID)->where('id',$id)->first();
      $landlords = landlords::join('customer_group','customer_group.customerID','=','customers.id')
							->where('customers.businessID',Auth::user()->businessID)
							->where('customer_group.groupID',1)
							->select('*','customers.id as customerID','customers.created_at as date_added')
							->OrderBy('customers.id','DESC')
							->get();
---
select *, `customers`.`id` as `customerID`, `customers`.`created_at` as `date_added` from `customers` inner join `customer_group` on `customer_group`.`customerID` = `customers`.`id` where `customers`.`businessID` = 1 and `customer_group`.`groupID` = 1 order by `customers`.`id` desc

      $property->laundry = $request->laundry;
      $property->furnished = $request->furnished;
      $property->description = $request->description;
      $property->save();
---
insert into `property` (`businessID`, `created_by`, `property_code`, `parentID`, `serial`, `property_type`, `ownwership_type`, `landlordID`, `year_built`, `bedrooms`, `bathrooms`, `size`, `price`, `features`, `smoking`, `laundry`, `furnished`, `description`, `updated_at`, `created_at`) values (1, 1, '9FJMCnOtNjzzXD9w', '2', 'Serviced offices', '12', 'single', '', '', '', '', '', '25000', 'Air conditioning, Cable ready, Carpet, Internet, Microwave, on, Telephone', '', '', '', '<p>If you are looking for a little more privacy, we offer fully furnished workspaces dedicated to you and team, allowing you the flexibility of growing your team without being concerned about running out of room.</p>\r\n\r\n<ul>\r\n	<li>Professional Reception Services</li>\r\n	<li>Prestigious Corporate Address</li>\r\n	<li>High Speed Internet / WiFi</li>\r\n	<li>Use of Address</li>\r\n	<li>Telephone Line</li>\r\n	<li>Security-Alarm / CCTV</li>\r\n	<li>Use of Boardroom</li>\r\n	<li>Meeting Room</li>\r\n	<li>IT Support</li>\r\n	<li>Video Conferencing</li>\r\n	<li>Insurance</li>\r\n	<li>Parking</li>\r\n</ul>\r\n\r\n<p>&nbsp;</p>', '2021-06-09 20:19:36', '2021-06-09 20:19:36')

   public function edit($pid,$uid)
   {
      $property = property::where('businessID',Auth::user()->businessID)->where('id',$pid)->first();
      $landlords = landlords::where('businessID',Auth::user()->businessID)->orderby('id','Desc')
                              ->select('customers.id as landlordID','customers.customer_name as landlord')
                              ->pluck('landlord','landlordID')
                              ->prepend('choose landlord','');
---
select `customers`.`id` as `landlordID`, `customers`.`customer_name` as `landlord` from `customers` where `businessID` = 1 order by `id` desc