app/Http/Controllers/app/property/dashboardController.php

select * from `business` inner join `currency` on `currency`.`id` = `business`.`base_currency` where `business`.`id` = 1 and `businessID` = '3zrE11WAHbSF23Pk' limit 1
select count(*) as aggregate from `customers` inner join `customer_group` on `customer_group`.`customerID` = `customers`.`id` where `customers`.`businessID` = 1 and `customer_group`.`groupID` = 1
---
   public function dashboard(){
      $business = business::join('currency','currency.id','=','business.base_currency')
                           ->where('business.id',Auth::user()->businessID)
                           ->where('businessID',Auth::user()->code)
                           ->first();

      $tenants = tenants::where('businessID',Auth::user()->businessID)->count();

      $vacant = property::where('businessID',Auth::user()->businessID)->whereNull('tenantID')->count();

      $occupied = property::where('businessID',Auth::user()->businessID)->where('tenantID','!=',"")->count();

      $owners = customers::join('customer_group','customer_group.customerID','=','customers.id')
                        ->where('customers.businessID',Auth::user()->businessID)
                        ->where('customer_group.groupID',1)
                        ->count();