app/Http/Controllers/app/property/imagesController.php

   public function index($id){

      $property = property::where('businessID',Auth::user()->businessID)->where('id',$id)->first();
      if($property->property_code == ""){
         $code = Helper::generateRandomString(12);
         $property->property_code = $code;
         $property->save();
      }

      //get prioerty again
      $property = property::where('businessID',Auth::user()->businessID)->where('id',$id)->first();
---
select * from `property` where `businessID` = 1 and `id` = '4' limit 1