app/Http/Controllers/app/property/propertyController.php

   public function show($id)
   {
      $check = property::where('businessID',Auth::user()->businessID)->where('id',$id)->count();
      if($check == 1 ){
         $year = date('Y');
         $property = property::where('businessID',Auth::user()->businessID)->where('id',$id)->first();
         $business = business::join('currency','currency.id','=','business.base_currency')
                              ->where('business.id',Auth::user()->businessID)
                              ->where('businessID',Auth::user()->code)
                              ->first();
---
select * from `business` inner join `currency` on `currency`.`id` = `business`.`base_currency` where `business`.`id` = 1 and `businessID` = '3zrE11WAHbSF23Pk' limit 1

   public function vacant($id)
   {
      $business = business::join('currency','currency.id','=','business.base_currency')
                           ->where('business.id',Auth::user()->businessID)
                           ->where('businessID',Auth::user()->code)
                           ->first();

      $property = property::where('businessID',Auth::user()->businessID)->where('id',$id)->first();
      $units = property::where('businessID',Auth::user()->businessID)
                     ->where('parentID',$id)
                     ->whereNull('tenantID')
                     ->orderby('property.id','desc')
                     ->select('*', 'property.id as propID','property.property_type as typeID')
                     ->get();
---
select * from `business` inner join `currency` on `currency`.`id` = `business`.`base_currency` where `business`.`id` = 1 and `businessID` = '3zrE11WAHbSF23Pk' limit 1
select *, `property`.`id` as `propID`, `property`.`property_type` as `typeID` from `property` where `businessID` = 1 and `parentID` = '2' and `tenantID` is null order by `property`.`id` desc

   public function delete($id){
      //check if property is listed
      $checkListing = listings::where('propertyID',$id)->where('businessID',Auth::user()->businessID)->count();

      //check if has leases
      $checkLease = lease::where('propertyID',$id)->where('businessID',Auth::user()->businessID)->count();

      if($checkListing == 0 && $checkLease == 0){
         $property = property::where('id','=',$id)->where('businessID',Auth::user()->businessID)->first();
         $path = base_path().'/public/businesses/'.Wingu::business(Auth::user()->businessID)->businessID.'/property/'.$property->property_code.'/';

         //delete image from folder
         $oldimagename = property::where('id','=',$id)->where('businessID',Auth::user()->businessID)->select('image')->first();
         $delete = $path.$oldimagename->image;
         if (File::exists($delete)) {
            unlink($delete);
         }

         //update image
         $property->delete();
---
delete from `property` where `id` = 1