app/Http/Controllers/app/dashboard/dashboardController.php

         $branches->main_branch = 'Yes';
         $branches->businessID = Auth::user()->businessID;
         $branches->userID = Auth::user()->id;
         $branches->save();
---
insert into `hr_branches` (`branch_name`, `main_branch`, `businessID`, `userID`, `updated_at`, `created_at`) values ('Main branch', 'Yes', 4, 4, '2021-06-09 12:42:26', '2021-06-09 12:42:26')