app/Http/Controllers/app/settings/integrations/payments/paymentsController.php

select *, `business_payment_integrations`.`id` as `businessIntegrationID`, `business_payment_integrations`.`status` as `paymentStatus`, `status`.`name` as `statusName`, `payment_integrations`.`name` as `integration_name` from `business_payment_integrations` inner join `payment_integrations` on `payment_integrations`.`id` = `business_payment_integrations`.`integrationID` inner join `status` on `status`.`id` = `business_payment_integrations`.`status` where `business_payment_integrations`.`businessID` = 1 order by `business_payment_integrations`.`id` desc
select `name`, `id` from `payment_integrations` where `status` = 15
---
   public function index()
   {
      //create creditnote settings for the account
      $check = creditnote_settings::where('businessID',Auth::user()->businessID)->count();
         if($check != 1){
         Finance::creditnote_setting_setup();
      }

      //create invoice settings for the account
      $check = invoice_settings::where('businessID',Auth::user()->businessID)->count();
			if($check != 1){
				Finance::invoice_setting_setup();
			}

      $businessIntegrations = business_payment_integrations::join('payment_integrations','payment_integrations.id','=','business_payment_integrations.integrationID')
                           ->join('status','status.id','=','business_payment_integrations.status')
                           ->where('business_payment_integrations.businessID',Auth::user()->businessID)
                           ->orderby('business_payment_integrations.id','desc')
                           ->select('*','business_payment_integrations.id as businessIntegrationID','business_payment_integrations.status as paymentStatus','status.name as statusName','payment_integrations.name as integration_name')
                           ->get();

      $integrations = payment_integrations::where('status',15)->pluck('name','id')->prepend('Choose your preferred payment integrations', '');