app/Http/Controllers/app/property/marketing/listingController.php

update `property` set `listing_status` = 49, `property`.`updated_at` = '2021-06-09 20:20:00' where `id` = 4
---
   public function add_to_list($propertyID){

      //check if property has an active listing
      $check = listings::where('status',15)->where('propertyID',$propertyID)->count();

      if($check == 0){
         $property = property::where('id',$propertyID)->where('businessID',Auth::user()->businessID)->first();
         $property->listing_status = 49;
         $property->save();

select * from `business` inner join `currency` on `currency`.`id` = `business`.`base_currency` where `business`.`id` = 1 limit 1
select *, `property_listings`.`id` as `listID`, `property_listings`.`propertyID` as `propertyID`, `property_listings`.`title` as `title`, `status`.`name` as `statusName`, `property_listings`.`price` as `price` from `property_listings` inner join `property` on `property`.`id` = `property_listings`.`propertyID` inner join `status` on `status`.`id` = `property_listings`.`status` where `property_listings`.`businessID` = 1 order by `property_listings`.`id` desc
---
   public function index(){
      $business = business::join('currency','currency.id','=','business.base_currency')
                           ->where('business.id',Auth::user()->businessID)
                           ->first();

      $properties = listings::join('property','property.id','=','property_listings.propertyID')
                           ->join('status','status.id','=','property_listings.status')
                           ->where('property_listings.businessID',Auth::user()->businessID)
                           ->select('*','property_listings.id as listID','property_listings.propertyID as propertyID','property_listings.title as title','status.name as statusName','property_listings.price as price')
                           ->orderby('property_listings.id','desc')
                           ->get();

select *, `property_listings`.`id` as `listID`, `property_listings`.`title` as `list_title`, `property`.`parentID` as `paro`, `property`.`id` as `propertyID`, `property_listings`.`price` as `price` from `property_listings` inner join `property` on `property`.`id` = `property_listings`.`propertyID` where `property_listings`.`id` = '3' and `property_listings`.`businessID` = 1 limit 1
select * from `property` where `id` = 2 and `businessID` = 1 limit 1
---
   public function edit($id){
      $property = listings::join('property','property.id','=','property_listings.propertyID')
                        ->where('property_listings.id',$id)
                        ->where('property_listings.businessID',Auth::user()->businessID)
                        ->select('*','property_listings.id as listID','property_listings.title as list_title','property.parentID as paro','property.id as propertyID','property_listings.price as price')
                        ->first();

      $images = documents::where('fileID',$property->propertyID)
                           ->where('businessID',Auth::user()->businessID)
                           ->where('section','property/images')
                           ->orderby('id','desc')
                           ->get();

      if($property->paro == 0){
         $parent = property::where('id',$property->propertyID)->where('businessID',Auth::user()->businessID)->first();
      }else{
         $parent = property::where('id',$property->paro)->where('businessID',Auth::user()->businessID)->first();

select count(*) as aggregate from `property` where `businessID` = 1 and `id` = '4'
select * from `property` where `id` = '4' and `businessID` = 1 limit 1
---
   public function update(Request $request){
      $this->validate($request, [
         'list_title' => 'required',
         'price' => 'required',
         'category' => 'required'
      ]);

      //validate the parent property to avoid users changing value via browser
      $check = property::where('businessID',Auth::user()->businessID)->where('id',$request->propertyID)->count();
      if($check == 0){
         Session::flash('error', 'The is an issue with the submitted data, You need to start over again !!!');

         return redirect()->back();
      }

      $property = property::where('id',$request->propertyID)->where('businessID',Auth::user()->businessID)->first();

update `property` set `geolocation` = 'Ambank House, Nairobi, Kenya', `latitude` = '-1.2817939', `longitude` = '36.8161922', `features` = 'Air conditioning, Cable ready, Carpet, Internet, Microwave, Telephone', `amenities` = 'Elevator', `furnished` = 'Yes', `description` = '<p>If you are looking for a little more privacy, we offer fully furnished workspaces dedicated to you and team, allowing you the flexibility of growing your team without being concerned about running out of room.</p>\r\n<ul>\r\n<li>Professional Reception Services</li>\r\n<li>Prestigious Corporate Address</li>\r\n<li>High Speed Internet / WiFi</li>\r\n<li>Use of Address</li>\r\n<li>Telephone Line</li>\r\n<li>Security-Alarm / CCTV</li>\r\n<li>Use of Boardroom</li>\r\n<li>Meeting Room</li>\r\n<li>IT Support</li>\r\n<li>Video Conferencing</li>\r\n<li>Insurance</li>\r\n<li>Parking</li>\r\n</ul>\r\n<p>&nbsp;</p>', `ownwership_type` = '', `updated_by` = 1, `property`.`updated_at` = '2021-06-09 20:22:00' where `id` = 4
---
      $property->laundry = $request->laundry;
      $property->furnished = $request->furnished;
      $property->description = $request->description;
      $property->save();

update `property` set `listing_status` = '', `property`.`updated_at` = '2021-06-09 11:32:36' where `id` = 1
---
   public function cancel_listing($propertyID,$listID){
      $date = date('Y-m-d');
      $property = property::where('id',$propertyID)->where('businessID',Auth::user()->businessID)->where('listing_status',49)->first();
      $property->listing_status = NULL;
      $property->save();