app/Http/Controllers/app/settings/users/rolesController.php

   public function index()
   {
      $roles = Role::where('businessID',Auth::user()->businessID)->orderby('id','desc')->get();
---
select * from `roles` where `businessID` = 1 order by `id` desc

   public function create(){
      $modules = business_modules::join('modules','modules.id','=','business_modules.moduleID')
                        ->where('businessID',Auth::user()->businessID)
                        ->where('module_status',15)
                        ->select('*','modules.id as modID')
                        ->get();
---
select *, `modules`.`id` as `modID` from `business_modules` inner join `modules` on `modules`.`id` = `business_modules`.`moduleID` where `businessID` = 1 and `module_status` = 15

   public function store(Request $request){

      $this->validate($request, [
         'display_name' => 'required|max:255',
         'description' => 'sometimes|max:255',
      ]);

      $role = new Role;
      $role->display_name = $request->display_name;
      $role->name = Helper::seoUrl($request->display_name);
      $role->description = $request->description;
      $role->businessID = Auth::user()->businessID;
      $role->created_by = Auth::user()->id;
      $role->updated_by = Auth::user()->id;
      $role->save();

      $permission = count(collect($request->permissions));
      if($permission > 0){
         //upload new category
         for($i=0; $i < count($request->permissions); $i++){
            $permission = new permission_role;
            $permission->permission_id = $request->permissions[$i];
            $permission->role_id = $role->id;
            $permission->businessID = Auth::user()->businessID;
            $permission->updated_by = Auth::user()->id;
            $permission->save();
---
insert into `roles` (`display_name`, `name`, `description`, `businessID`, `created_by`, `updated_by`, `updated_at`, `created_at`) values ('Agent', 'agent', '', 1, 1, 1, '2021-06-09 14:11:33', '2021-06-09 14:11:33')
insert into `permission_role` (`permission_id`, `role_id`, `businessID`, `updated_by`, `updated_at`, `created_at`) values ('343', 2, 1, 1, '2021-06-09 14:11:33', '2021-06-09 14:11:33')

   public function edit($id){
      $role = Role::where('id',$id)->where('businessID',Auth::user()->businessID)->first();
      $modules = business_modules::join('modules','modules.id','=','business_modules.moduleID')
                     ->where('businessID',Auth::user()->businessID)
                     ->where('module_status',15)
                     ->select('*','modules.id as modID')
                     ->get();
---
select * from `roles` where `id` = '2' and `businessID` = 1 limit 1
select *, `modules`.`id` as `modID` from `business_modules` inner join `modules` on `modules`.`id` = `business_modules`.`moduleID` where `businessID` = 1 and `module_status` = 15

   public function update(Request $request, $id){
      $this->validate($request, [
         'display_name' => 'required|max:255',
         'description' => 'sometimes|max:255'
      ]);

      $role = Role::find($id);
      $role->name = Helper::seoUrl($request->display_name);
      $role->display_name = $request->display_name;
      $role->description = $request->description;
      $role->updated_by = Auth::user()->id;
      $role->save();

      $permission = count(collect($request->permissions));
      if($permission > 0){
         DB::table('permission_role')->where('role_id',$id)->delete();
         //upload new category
         for($i=0; $i < count($request->permissions); $i++){
            $permission = new permission_role;
            $permission->permission_id = $request->permissions[$i];
            $permission->role_id = $role->id;
            $permission->businessID = Auth::user()->businessID;
            $permission->updated_by = Auth::user()->id;
            $permission->save();
---
delete from `permission_role` where `role_id` = '2'
insert into `permission_role` (`permission_id`, `role_id`, `businessID`, `updated_by`, `updated_at`, `created_at`) values ('343', 2, 1, 1, '2021-06-09 14:23:51', '2021-06-09 14:23:51')