app/Http/Controllers/app/settings/users/UserController.php

select * from `users` where `businessID` = 1 order by `id` desc
---
   public function index()
   {
      //check if account has no branches
      $checkBranches = branches::where('businessID',Auth::user()->businessID)->count();
      if($checkBranches == 0){
         $branches = new branches;
         $branches->branch_name = 'Main branch';
         $branches->main_branch = 'Yes';
         $branches->businessID = Auth::user()->businessID;
         $branches->userID = Auth::user()->id;
         $branches->save();
      }

      $users = User::OrderBy('id','DESC')->where('businessID',Auth::user()->businessID)->get();

select * from `roles` where `businessID` = 1
---
   public function create(){
      $roles = Role::where('businessID',Auth::user()->businessID)->get();

select count(*) as aggregate from `users` where `email` = 'agent@ascendas.co.ke'
insert into `users` (`name`, `email`, `branch_id`, `businessID`, `userID`, `code`, `statusID`, `remember_token`, `password`, `updated_at`, `created_at`) values ('Agent', 'agent@ascendas.co.ke', '1', 1, 1, '3zrE11WAHbSF23Pk', 7, 'j2h1KHEkG', 'y$lr7D4FLQ0FFfi7aw7pqOAefBA2fwMuBno3lklgsSr3JM0zv6pCLfO', '2021-06-09 14:20:38', '2021-06-09 14:20:38')
---
   public function store(Request $request){
      $this->validate($request,[
         'name' => 'required',
         'email' => 'required', 'string', 'email', 'max:255', 'unique:users',
         'password' => 'required', 'string', 'min:8', 'confirmed',
         'roles' => 'required',
         'branch' => 'required',
      ]);

      $check = User::where('email',$request->email)->count();
      if($check != 0){
         Session::flash('error','The email you have provided is already in use');
         return redirect()->back();
      }

      //create employee
      $employee = new User;
      $employee->name = $request->name;
      $employee->email = $request->email;
      $employee->branch_id = $request->branch;
      $employee->businessID = Auth::user()->businessID;
      $employee->userID = Auth::user()->id;
      $employee->code = Wingu::business()->businessID;
      $employee->statusID = 7;
      $employee->remember_token = Helper::generateRandomString(9);
      $employee->password = Hash::make($request->password);
      $employee->save();

select * from `roles` where `businessID` = 1
select *, `branch_id` as `branch` from `users` where `id` = '5' and `businessID` = 1 limit 1
---
   public function edit($id){
      $roles = Role::where('businessID',Auth::user()->businessID)->get();
      $user = User::where('id', $id)->where('businessID',Auth::user()->businessID)->select('*','branch_id as branch')->first();