app/Http/Controllers/app/crm/callbacks/landingpage.php

            $contact_persons->contact_email = $request->email;
            $contact_persons->phone_number = $request->phone_number;
            $contact_persons->businessID = $account->id;
            $contact_persons->save();
---
insert into `customer_contact_persons` (`customerID`, `names`, `contact_email`, `phone_number`, `businessID`, `updated_at`, `created_at`) values (6, 'Griffin kisia', 'grifkisia@gmail.com', '254700928867', 1, '2021-06-09 11:44:10', '2021-06-09 11:44:10')