app/Helpers/Finance.php

insert into `creditnote_settings` (`number`, `prefix`, `businessID`, `userID`, `updated_at`, `created_at`) values (0, 'CN', 1, 1, '2021-06-09 14:13:16', '2021-06-09 14:13:16')
---
	public static function creditnote_setting_setup(){
		$create = new creditnote_settings;
		$create->number = 0;
		$create->prefix = 'CN';
		$create->businessID = Auth::user()->businessID;
		$create->userID = Auth::user()->id;
		$create->save();

insert into `invoice_settings` (`number`, `prefix`, `businessID`, `userID`, `updated_at`, `created_at`) values (0, 'INV', 1, 1, '2021-06-09 14:13:16', '2021-06-09 14:13:16')
---
	public static function invoice_setting_setup(){
		$create = new invoice_settings;
		$create->number = 0;
		$create->prefix = 'INV';
		$create->businessID = Auth::user()->businessID;
		$create->userID = Auth::user()->id;
		$create->save();