app/Helpers/Wingu.php

insert into `activity_log` (`activity`, `section`, `type`, `userID`, `activityID`, `businessID`, `ip_address`, `updated_at`, `created_at`) values ('Ascendas Has uploaded image(s) to property -Ascendas Ambank Offices', 'Property', 'Images', 1, '4', 1, '41.212.94.234', '2021-06-09 20:25:12', '2021-06-09 20:25:12')
---
   public static function activity($activities, $section, $type, $userID, $activityID, $businessID){
      $activity = new activity_log;
      $activity->activity = $activities;
      $activity->section  = $section;
      $activity->type     = $type;
      $activity->userID  = Auth::user()->id;
      $activity->activityID = $activityID;
      $activity->businessID = $businessID;
      $activity->ip_address = Helper::get_client_ip();
      $activity->save();

select * from `business` where `id` = 1 and `businessID` = '3zrE11WAHbSF23Pk' limit 1
---
   public static function business(){
      $business = business::where('id',Auth::user()->businessID)->where('businessID',Auth::user()->code)->first();

select * from `users` where `id` = 1 and `businessID` = 1 limit 1
---
   public static function user($id){
      $user = User::where('id',$id)->where('businessID',Auth::user()->businessID)->first();

select count(*) as aggregate from `users` where `id` = 1 and `businessID` = 1
---
   public static function check_user($id){
      $check = User::where('id',$id)->where('businessID',Auth::user()->businessID)->count();

select count(*) as aggregate from `users` where `businessID` = 1
---
   public static function count_user(){
      $count = User::where('businessID',Auth::user()->businessID)->count();

select * from `business` where `id` = 1 and `businessID` = '3zrE11WAHbSF23Pk' limit 1
---
   public static function plan(){
      $business = business::where('id',Auth::user()->businessID)->where('businessID',Auth::user()->code)->first();

select * from `permissions` where `groupID` = 120
---
   public static function permissions_by_group($id){
      $permissions = Permission::where('groupID',$id)->get();