app/Http/Controllers/app/settings/applications/applicationController.php

   public function index(){
      $applications = modules::join('business_modules','business_modules.moduleID','=','modules.id')
                              ->where('business_modules.module_status','!=',22)
                              ->where('business_modules.businessID',Auth::user()->businessID)
                              ->select('*','modules.id as moduleID','business_modules.id as business_module_id')
                              ->get();
---
select *, `modules`.`id` as `moduleID`, `business_modules`.`id` as `business_module_id` from `modules` inner join `business_modules` on `business_modules`.`moduleID` = `modules`.`id` where `business_modules`.`module_status` != 22 and `business_modules`.`businessID` = 1

   public function billing($applicationID){
      $days = 31;
      $invoiceDate = date('Y-m-d');
      $invoiceDue = date('Y-m-d', strtotime($invoiceDate. ' + '.$days.' days'));

      $module = business_modules::join('modules','modules.id','=','business_modules.moduleID')
                                 ->where('businessID',Auth::user()->businessID)
                                 ->where('business_modules.id',$applicationID)
                                 ->where('payment_status',2)
                                 ->where('module_status',15)
                                 ->select('*','business_modules.price as module_price','business_modules.id as business_module_id')
                                 ->first();
---
select *, `business_modules`.`price` as `module_price`, `business_modules`.`id` as `business_module_id` from `business_modules` inner join `modules` on `modules`.`id` = `business_modules`.`moduleID` where `businessID` = 1 and `business_modules`.`id` = '4' and `payment_status` = 2 and `module_status` = 15 limit 1