app/Http/Controllers/app/crm/leads/leadsController.php

   public function index()
   {
      //check if user is linked to a business and allow access
      $leads = customers::where('customers.businessID',Auth::user()->businessID)
                        ->where('category','Lead')
                        ->select('*','customers.id as leadID')
                        ->OrderBy('customers.id','DESC')
                        ->get();
---
select *, `customers`.`id` as `leadID` from `customers` where `customers`.`businessID` = 1 and `category` = 'Lead' order by `customers`.`id` desc

   public function create(){
      $country = country::pluck('name','id')->prepend('Choose country', '');
      $languages = languages::pluck('name','id')->prepend('Choose language', '');
      $employees = User::where('businessID',Auth::user()->businessID)->select('name as names','id')->pluck('names','id')->prepend('Choose users');
---
select `name` as `names`, `id` from `users` where `businessID` = 1


			//delete contact
			$deleteclient = customers::where('id','=',$id)->where('businessID',Auth::user()->businessID)->first();
			$deleteclient->delete();
---
delete from `customers` where `id` = 7