app/Http/Controllers/app/wingu/applicationController.php

insert into `wingu_cart` (`module_id`, `module_name`, `description`, `qty`, `price`, `total_amount`, `businessID`, `userID`, `updated_at`, `created_at`) values (13, 'CRM', 'Customer relationship management', 1, '15', '15', 1, 1, '2021-06-09 10:29:37', '2021-06-09 10:29:37')
---
   public function add_to_cart($moduleID){

      $checkCart = wingu_cart::where('module_id',$moduleID)->where('businessID',Auth::user()->businessID)->count();
      if($checkCart == 0){
         $applications = modules::find($moduleID);

         $add = new wingu_cart;
         $add->module_id = $applications->id;
         $add->module_name = $applications->name;
         $add->description = $applications->caption;
         $add->qty = 1;
         $add->price = $applications->price;
         $add->total_amount = $applications->price;
         $add->businessID = Auth::user()->businessID;
         $add->userID = Auth::user()->id;
         $add->save();

delete from `wingu_cart` where `id` = '5' and `businessID` = 1 and `userID` = 1
---
   public function remove_cart($cartID){
      wingu_cart::where('id',$cartID)->where('businessID',Auth::user()->businessID)->where('userID',Auth::user()->id)->delete();

update `wingu_invoice_settings` set `number` = 9, `wingu_invoice_settings`.`updated_at` = '2021-06-09 10:29:44' where `id` = 1
---

            //settings
            $invoiceSettings->number = $invoiceSettings->number + 1;
            $invoiceSettings->save();

delete from `wingu_cart` where `businessID` = 1 and `id` = 7
---
            Mail::to($to)->send(new systemMail($content,$subject));

            //delete cart item
            wingu_cart::where('businessID',Auth::user()->businessID)->where('id',$item->id)->delete();