app/Http/Controllers/app/crm/dashboard/dashboardController.php

select SUM(value) as value from `deals` where year(`created_at`) = '2021' and `status` = 46 and `businessID` = 1 group by `status`
select SUM(value) as value from `deals` where year(`created_at`) = '2021' and `status` = 45 and `businessID` = 1 group by `status`
select SUM(value) as value from `deals` where year(`created_at`) = '2021' and `status` is null and `businessID` = 1 group by `status`
---
                        ->selectRaw("DATE_FORMAT(created_at, '%M') AS month")
                        ->pluck('month');

      $lostValue =  DB::table('deals')
                        ->whereYear('created_at','=', $year)
                        ->where('status',46)
                        ->select(DB::raw('SUM(value) as value'))
                        ->where('businessID',Auth::user()->businessID)
                        ->groupBy('status')
                        ->pluck('value');

      $wonValue =  DB::table('deals')
                        ->whereYear('created_at','=', $year)
                        ->where('status',45)
                        ->select(DB::raw('SUM(value) as value'))
                        ->where('businessID',Auth::user()->businessID)
                        ->groupBy('status')
                        ->pluck('value');

      $openValue =  DB::table('deals')
                        ->whereYear('created_at','=', $year)
                        ->whereNull('status')
                        ->select(DB::raw('SUM(value) as value'))
                        ->where('businessID',Auth::user()->businessID)
                        ->groupBy('status')
                        ->pluck('value');